sicp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-29 Thu 02:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Aaryan Pashine" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga4f7b39">1. Introduction to Computation</a>
<ul>
<li><a href="#orgc395c02">1.1. Procedure and data abstraction</a></li>
<li><a href="#org4b794a1">1.2. Metalinguistic Abstraction</a></li>
<li><a href="#org3dee654">1.3. Computation as a metaphor</a></li>
<li><a href="#org47b21d1">1.4. Distinction between process and procedure</a></li>
<li><a href="#orgf538d4c">1.5. Scheme</a>
<ul>
<li><a href="#orgb05a095">1.5.1. Language primitives</a></li>
<li><a href="#org3291e9b">1.5.2. Cominations</a></li>
<li><a href="#org70fa82d">1.5.3. Read-Eval-Print</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga4f7b39" class="outline-2">
<h2 id="orga4f7b39"><span class="section-number-2">1.</span> Introduction to Computation</h2>
<div class="outline-text-2" id="text-1">
<p>
Just basic imperative, declarative stuff&#x2026;
</p>
</div>
<div id="outline-container-orgc395c02" class="outline-3">
<h3 id="orgc395c02"><span class="section-number-3">1.1.</span> Procedure and data abstraction</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Creating abstractions/black-boxes. Interfaces and programming paradigms -&gt; in order to make abstractions work together. Interfaces are essentially what programming is all about, bringing abstractions together.
</p>
</div>
</div>
<div id="outline-container-org4b794a1" class="outline-3">
<h3 id="org4b794a1"><span class="section-number-3">1.2.</span> Metalinguistic Abstraction</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Layered languages, hardware/register languages&#x2026; This seems interesting. Curious to see what this will be. 
</p>
</div>
</div>
<div id="outline-container-org3dee654" class="outline-3">
<h3 id="org3dee654"><span class="section-number-3">1.3.</span> Computation as a metaphor</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Capture descriptions of computaitonal practices to design solution to complex problems.
Using language to do so - need fundamental primitives (means of combination and abstractions)
</p>
</div>
</div>
<div id="outline-container-org47b21d1" class="outline-3">
<h3 id="org47b21d1"><span class="section-number-3">1.4.</span> Distinction between process and procedure</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Process as exact steps, and procedure describes the steps
</p>
</div>
</div>
<div id="outline-container-orgf538d4c" class="outline-3">
<h3 id="orgf538d4c"><span class="section-number-3">1.5.</span> Scheme</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-orgb05a095" class="outline-4">
<h4 id="orgb05a095"><span class="section-number-4">1.5.1.</span> Language primitives</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
numbers
strings
booleans
</p>

<p>
each element can be asked its value
</p>
</div>
</div>
<div id="outline-container-org3291e9b" class="outline-4">
<h4 id="org3291e9b"><span class="section-number-4">1.5.2.</span> Cominations</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
(+ 2 3)
 ^
 symbol that dictates how sub-expressions are applied
</p>

<p>
(+ (* 2 3) 4 ) -&gt; 10
</p>

<p>
this can be nested. 
</p>

<p>
(define score 23)
</p>

<p>
they can be named, for abstraction
</p>
</div>
</div>
<div id="outline-container-org70fa82d" class="outline-4">
<h4 id="org70fa82d"><span class="section-number-4">1.5.3.</span> Read-Eval-Print</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
Woop! we knw this&#x2026; but basically above stuff to lol
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Aaryan Pashine</p>
<p class="date">Created: 2025-05-29 Thu 02:39</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
